{
  "education": [
    {
      "awards_achievements": null,
      "degree": "Master of Management",
      "department": "Business Analysis",
      "duration": "2023-2024",
      "school_name": "Trent university"
    },
    {
      "awards_achievements": null,
      "degree": "Bachelor of Engineering",
      "department": "Electronics and Communication Engineering",
      "duration": "2017-2021",
      "school_name": "Karpagam College of Engineering"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_SupriyaRavichandran",
  "highlighted_projects": [
    {
      "description": "Developed an interactive Power BI dashboard to analyze customer feedback data collected from multiple sources, providing real-time insights into customer sentiment and satisfaction trends. Conducted requirement elicitation sessions with stakeholders to define KPIs and reporting needs. Utilized SQL for data extraction, transformation, and loading (ETL) processes, ensuring data accuracy. Designed intuitive data visualizations for better decision-making, resulting in a 20% improvement in customer service response time.",
      "git_url": "https://github.com/jarviscanada/jarvis_profile_builder",
      "name": "Customer Feedback Analysis Dashboard"
    },
    {
      "description": "Led a process improvement initiative in ServiceNow to enhance IT service request management, collaborating with cross-functional teams to identify bottlenecks and streamline workflows. Documented current and future state processes using Microsoft Visio, performing gap analysis to identify improvement opportunities. Conducted root cause analysis for recurring service issues, proposing automated solutions to reduce incident resolution time by 30%. Managed project documentation in Confluence and utilized Jira for task tracking and Agile sprint planning.",
      "git_url": null,
      "name": "IT Service Management Optimization"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Analyzed retail sales data to uncover customer purchasing patterns, sales trends, and revenue optimization opportunities. Performed data wrangling, created visualizations using matplotlib and Tableau, and delivered insights to guide business strategy. Applied RFM (Recency, Frequency, Monetary) segmentation and designed dashboards to highlight actionable metrics.",
      "git_url": "/linux_sql",
      "name": "Python Data Analytics  Retail Sales Analysis"
    },
    {
      "description": "Developed and implemented a Linux-based clustering solution for efficient data management and high availability. Utilized clustering techniques to distribute workloads across multiple nodes, ensuring system reliability and fault tolerance. Integrated tools like Docker for containerization and PostgreSQL for data storage. Automated tasks with Bash scripts and scheduled jobs using crontab for continuous monitoring and data collection. Optimized system performance by managing resource allocation and reducing downtime.",
      "git_url": "/linux_sql",
      "name": "Linux Cluster Resource Monitoring App"
    },
    {
      "description": "Led the end-to-end creation of Business Requirements Document (BRD) and Software Requirements Document (SRD) for a stock trading application proof of concept. Conducted stakeholder interviews to gather functional and non-functional requirements, defined project scope, and translated business needs into technical specifications. Emphasized usability, accessibility, and integration with third-party services (e.g., Alpha Vantage, bank APIs). Developed scalable documentation for investor and board presentation use, aligning delivery goals for Q2 2026.",
      "git_url": "/linux_sql",
      "name": "Stock Trading App"
    }
  ],
  "name": "Supriya Jones",
  "others": [
    {
      "bullets": [
        "Microsoft Azure Fundamentals AZ-900",
        "Google Project Management Professional",
        "Microsoft Power BI Data Analyst (PL-300)",
        "Sustainability Initiatives Volunteer"
      ],
      "title": "Certificates"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis Consulting",
      "description": "Collaborated with cross-functional teams in an Agile environment, ensuring successful sprint-based project delivery. Authored BRDs (Business Requirements Documents) and SRDs (System Requirements Documents) to maintain clear, actionable requirements. Utilized Bash scripting and Git for process automation and version control, enhancing system efficiency and compliance.",
      "duration": "April 2025 - Present",
      "title": "Business System Analyst"
    },
    {
      "company": "Knorket.AI",
      "description": "Collaborated with stakeholders to design AI-driven solutions, enhancing process efficiency by 15%. Defined and translated business requirements for developers, ensuring project alignment and on-time delivery. Conducted risk management, cost-benefit analysis, and gap analysis, optimizing system performance. Developed executive presentation decks outlining timelines, growth strategies, and data insights. Streamlined documentation using Confluence and ServiceNow, improving communication, issue tracking, and compliance.",
      "duration": "May 2024 - August 2024",
      "title": "Business System Analyst"
    },
    {
      "company": "Cognizant Technology Solutions",
      "description": "Utilized SQL to analyze complex datasets, enhancing process efficiency by 20%. Designed 15+ Power BI dashboards and 20+ SSRS reports, improving visibility into key metrics. Automated data processing with Python, reducing manual work by 30% and boosting accuracy. Bridged business and IT teams, ensuring solutions met business needs while maintaining compliance. Managed user stories and BRDs in Jira within an Agile framework, promoting seamless collaboration. Led design meetings to align stakeholders, and created Visio diagrams for clear workflow visualization.",
      "duration": "Feb 2021 - April 2023",
      "title": "Business System Analyst"
    }
  ],
  "skills": {
    "Business Skills": [
      "Communication",
      "Collaboration",
      "Requirement Elicitation",
      "Stakeholder Management",
      "Documentation",
      "Microsoft Excel",
      "Microsoft Visio",
      "Presentation Design",
      "Process Analysis",
      "Risk Management",
      "Cost-Benefit Analysis"
    ],
    "Technical Skills": [
      "SQL",
      "Power BI",
      "SSRS",
      "Confluence",
      "Jira",
      "ServiceNow",
      "Git",
      "Linux",
      "Python",
      "Agile/Scrum"
    ]
  },
  "summary": "I'm a detail-oriented and curious Business Systems Analyst with a passion for understanding how things work and making them work better. With a background in engineering and management, I naturally bridge the gap between business needs and technical solutions. I thrive in collaborative environments where I can engage with stakeholders, ask the right questions, and translate ideas into actionable outcomes. Whether it's writing BRDs and SRDs, building dashboards that bring data to life, or automating manual workflows, I enjoy solving problems that matter. My work is driven by a commitment to continuous improvement and a passion for building solutions that make life easier, whether for decision-makers tracking big-picture metrics or everyday users looking for simplicity and clarity.\n"
}
